### Terraform Plan

```
Terraform will perform the following actions:

  # aws_ecr_repository.abatugo_autoscribe will be created
  + resource "aws_ecr_repository" "abatugo_autoscribe" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "abatugo_autoscribe"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }
```